{"pageProps":{"frontMatter":{"title":"Qualifying for EB1 Green Card as a Software Engineer","date":"2022-03-25T08:42:50.450Z","description":"I recently got my US green card via an EB1-A (Alien of Extraordinary Ability) petition and many people have been asking me about this I thought I'd share my journey and my learnings.","issue":6},"slug":"eb1","mdxSource":{"compiledSource":"var m=Object.defineProperty,u=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var n=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var p=(e,t,o)=>t in e?m(e,t,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[t]=o,r=(e,t)=>{for(var o in t||(t={}))n.call(t,o)&&p(e,o,t[o]);if(i)for(var o of i(t))s.call(t,o)&&p(e,o,t[o]);return e},l=(e,t)=>u(e,c(t));var h=(e,t)=>{var o={};for(var a in e)n.call(e,a)&&t.indexOf(a)<0&&(o[a]=e[a]);if(e!=null&&i)for(var a of i(e))t.indexOf(a)<0&&s.call(e,a)&&(o[a]=e[a]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var a=o,{components:e}=a,t=h(a,[\"components\"]);return mdx(MDXLayout,l(r(r({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"I recently got my US green card via an EB1-A (Alien of Extraordinary Ability) petition and \",mdx(\"strong\",{parentName:\"p\"},\"A LOT\"),\" of people have been asking me about this so I thought I'd share my journey and share my learnings.\"),mdx(\"h2\",null,\"What is an EB1-A?\"),mdx(\"p\",null,\"EB-1A visas are the most difficult to get, as well as the most flexible as you can self-petition without a job offer. They are also \",mdx(\"strong\",{parentName:\"p\"},\"current\"),\" and do not have a multi-year backlog like EB2/EB3 if you belong to China, India, etc.\"),mdx(\"p\",null,\"Quoting USCIS from \",mdx(\"a\",r({parentName:\"p\"},{href:\"https://www.uscis.gov/working-in-the-united-states/permanent-workers/employment-based-immigration-first-preference-eb-1\"}),\"this page\"),\":\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"You must be able to demonstrate extraordinary ability in the sciences, arts, education, business, or athletics through sustained national or international acclaim.\")),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"You must meet at least 3 of the 10 criteria below, or provide evidence of a one-time achievement (i.e., Pulitzer, Oscar, Olympic Medal) as well as evidence showing that you will be continuing to work in the area of your expertise. No offer of employment or labor certification is required.\")),mdx(\"p\",null,\"This description and the criterias are scary but I think the bar is not as high as it seems.\"),mdx(\"h2\",null,\"A little about me\"),mdx(\"p\",null,\"I am a software engineer with a bachelors degree in Computer Science. I have been working since 2013 but have been programming well before that. I currently work at Google but this petition was filed prior to joining Google.\"),mdx(\"p\",null,\"I enjoy programming and so I have \",mdx(\"a\",r({parentName:\"p\"},{href:\"https://asadmemon.com/projects/\"}),\"many side-projects\"),\". I also co-founded a \",mdx(\"a\",r({parentName:\"p\"},{href:\"https://www.remoteinterview.io/\"}),\"startup\"),\", scaled it, and brought it to US. I have zero patents or research papers and sadly no Nobels or Oscars . If your profile matches mine, you may be able to qualify for this visa.\"),mdx(\"h2\",null,\"How to match EB1-A's high bar?\"),mdx(\"p\",null,\"First, you need a good immigration lawyer who specializes in this category of petitions. It all depends on how good your lawyer's game is in fitting your career to the \",mdx(\"a\",r({parentName:\"p\"},{href:\"https://www.uscis.gov/working-in-the-united-states/permanent-workers/employment-based-immigration-first-preference-eb-1#:~:text=Criteria%20for%20Demonstrating%20Extraordinary%20Ability\"}),\"criterias for EB1A\"),\". \"),mdx(\"p\",null,\"A good lawyer is also very expensive so expect to \",mdx(\"del\",{parentName:\"p\"},\"spend\"),\" invest anywhere from $15k to $25k or even more. I would recommend not using your company's lawyer or a big firm considering your non-research profile requires a more unorthodox and personalized petition specific to your profile and will not fit the boilerplate template that these bigger firms tend to use.\"),mdx(\"p\",null,\"I can share the lawyer I used, please reach out privately.\"),mdx(\"img\",{src:\"/assets/blog/eb1/lawyer.jpg\",height:\"400\"}),mdx(\"h2\",null,\"The Criterias\"),mdx(\"p\",null,\"Your sole goal is to prove that you meet atleast 3 of the 10 criterias. You may want to attempt 5 or so of them to prevent your case be denied for being too weak; if USCIS doesn't agree on your proof for multiple criterias, a denial will be harder to challenge than say an RFE (Request For Evidence) for some criterias.\"),mdx(\"p\",null,\"I attempted the following (five) criterias:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"strong\",{parentName:\"p\"},\"Performance of a leading or critical role in distinguished organizations:\"),`\nMy role in my startup counted here. I had to prove a) my role is critical and b) The organization is well-known. If you are a founding engineer or a senior engineer at your company and are leading a critical project, you will likely qualify for this.`)),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"strong\",{parentName:\"p\"},\"Published material about you in professional or major trade publications or other major media:\"),`\nMy startup and my side-projects were featured in many online publications (read tech-blogs) and a few mentions in top-tier publications (BBC, Acm.org, etc.). If you and your work were featured on popular websites/blogs, you may qualify for this.`)),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"strong\",{parentName:\"p\"},\"Original scientific, scholarly, artistic, athletic, or business-related contributions of major significance to the field:\"),\" Some of my projects were a fit the definition of this criteria. If you have patents, research papers or some side-project, this is where you list them.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"strong\",{parentName:\"p\"},\"Have been asked to judge the work of others, either individually or on a panel:\"),\" I had judged a few hackathons and international software competitions.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"strong\",{parentName:\"p\"},\"Receipt of lesser nationally or internationally recognized prizes or awards for excellence:\"),\" I had won \",mdx(\"em\",{parentName:\"p\"},\"many\"),' hackathons and competitions both before and after graduating from college, some qualified for this criteria. Note that USCIS does not consider \"student\" competitions here.'))),mdx(\"p\",null,\"Other criterias that may apply to you:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"strong\",{parentName:\"p\"},\"Evidence that you command a high salary or other significantly high remuneration in relation to others in the field:\"),\" If you are paid well (like top 5% of the industry), you may qualify for this.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},mdx(\"strong\",{parentName:\"p\"},\"Evidence of your membership in associations in the field which demand outstanding achievement of their members:\"),\" If you are a member of a prestigious association (like YC probably), you may qualify for this.\"))),mdx(\"h2\",null,\"RFE\"),mdx(\"p\",null,\"USCIS has started to be more stingy with EB1s so expect an RFE. More often than not, you are going to get one (or more).\"),mdx(\"p\",null,\"As I mentioned before, it mostly depends on how good your lawyer is in framing your case. I also got an RFE as USCIS asked for more proof on some criterias. Worry not, the laywer has to reframe the case and add some more evidence.\"),mdx(\"p\",null,\"Of note, I was highly impressed by the amount of detail; convincing counter-reasoning in the USCIS's RFE and the response my lawyer wrote to tackle it.\"),mdx(\"h2\",null,\"If and once the petition is approved\"),mdx(\"p\",null,\"Once the petition is approved. The next step is fairly straight-forward. You either need to file I-485 (Adjustment of Status) or book an interview appointment with the nearest embassy if you are outside of US at the time of approval.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"readingTime":5},"__N_SSG":true}