{"pageProps":{"frontMatter":{"title":"Deep Work (Sometimes) Pays Off","date":"2025-10-14T08:42:50.450Z","description":"An old passion project on multiplayer tech fueled a successful product ten years later.","issue":16},"slug":"deep","mdxSource":{"compiledSource":"var m=Object.defineProperty,c=Object.defineProperties;var u=Object.getOwnPropertyDescriptors;var t=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var l=(e,a,o)=>a in e?m(e,a,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[a]=o,s=(e,a)=>{for(var o in a||(a={}))i.call(a,o)&&l(e,o,a[o]);if(t)for(var o of t(a))r.call(a,o)&&l(e,o,a[o]);return e},d=(e,a)=>c(e,u(a));var p=(e,a)=>{var o={};for(var n in e)i.call(e,n)&&a.indexOf(n)<0&&(o[n]=e[n]);if(e!=null&&t)for(var n of t(e))a.indexOf(n)<0&&r.call(e,n)&&(o[n]=e[n]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var n=o,{components:e}=n,a=p(n,[\"components\"]);return mdx(MDXLayout,d(s(s({},layoutProps),a),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Back in 2012-2013, during my college days, I devoted six intense months to a deep dive into multiplayer Pac-Man and the intricacies of game netcode. My exploration covered everything from client-side prediction, server ticks, and WebSockets, to efficient message packing, game lobbies, region locking, and even the nuances of TCP/UDP packets and network congestion. It was an intense period, driven purely by obsession rather than explicit goals or deadlines. Eventually, I set it aside as life grew busier.\"),mdx(\"p\",null,\"A decade later, around 2023, those specific learnings became invaluable while I was building Playroom. Playroom is an easy-to-use SDK for adding multiplayer functionality to games, offering features like multiplayer lobbies, matchmaking, unreliable (WebRTC) and reliable (WebSockets) modes, player and room states, RPCs, etc.\"),mdx(\"p\",null,\"Today, \",mdx(\"a\",s({parentName:\"p\"},{href:\"https://docs.joinplayroom.com\"}),\"Playroom\"),\" effortlessly serves over 10 million monthly active users across numerous games.\"),mdx(\"p\",null,\"This stands as a clear instance of how pursuing interesting, challenging work, particularly in its depths and without the immediate prospect of monetary reward, has greatly benefited me later in life.\"),mdx(\"p\",null,\"These days I am in another deep-dive on SLAM systems for about year or so. You can see video demo and follow my progress on \",mdx(\"a\",s({parentName:\"p\"},{href:\"https://x.com/_asadmemon/status/1977737626951041225\"}),\"X\"),\". Again, no immediate rewards, some heuristics and pure obsession.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"readingTime":2},"__N_SSG":true}