{"pageProps":{"frontMatter":{"title":"Privileges","description":"Sometimes you meet a person who appears to be less successful than you, even though they are the same age as you. Which results in you…","date":"2016-09-09T08:42:18.768Z","categories":[],"keywords":[],"slug":"/@asadmemon/privileges-fb2716b44004"},"slug":"privileges","mdxSource":{"compiledSource":"var p=Object.defineProperty,m=Object.defineProperties;var y=Object.getOwnPropertyDescriptors;var a=Object.getOwnPropertySymbols;var n=Object.prototype.hasOwnProperty,i=Object.prototype.propertyIsEnumerable;var h=(e,t,o)=>t in e?p(e,t,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[t]=o,r=(e,t)=>{for(var o in t||(t={}))n.call(t,o)&&h(e,o,t[o]);if(a)for(var o of a(t))i.call(t,o)&&h(e,o,t[o]);return e},l=(e,t)=>m(e,y(t));var u=(e,t)=>{var o={};for(var s in e)n.call(e,s)&&t.indexOf(s)<0&&(o[s]=e[s]);if(e!=null&&a)for(var s of a(e))t.indexOf(s)<0&&i.call(e,s)&&(o[s]=e[s]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var s=o,{components:e}=s,t=u(s,[\"components\"]);return mdx(MDXLayout,l(r(r({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Sometimes you meet a person who appears to be less successful than you, even though they are the same age as you. Which results in you respecting them less. I have a different outlook on this and I judge people by how much progress they\\u2019ve made themselves than what they\\u2019d inherited. So to me it\\u2019s all about how they have reached to that point in life and from what.\"),mdx(\"p\",null,\"Now I\\u2019d go further: I\\u2019d say this method of judging a person can help us be better. Let me explain.\"),mdx(\"p\",null,\"At the time of birth you inherited some of the successes of your ancestors and you progressed from there. But this head start is not equal for all. So even if the child is a genius but is born in a less privileged society, they may face much more hurdles before reaching a \\u2018leveler\\u2019 like getting into a good enough college. So a poor child from third-world country has to first catch up on first-world education and then excel at it while being surrounded by people who are also less privileged. So essentially they have to outrun the less privileged people who surround them before even starting to outrun the rest of the world.\"),mdx(\"p\",null,\"And sadly this applies to everything in life. This is exactly why the children from rich families have more chances at success because their parents ensure enough head start and runway for them, but poor parents cannot. This results in a constantly increasing gap between rich and poor. Since the number of people who are able to outrun are way too low. The immediate answer I see is if somehow we can be more helping towards everyones\\u2019 struggles, we can mitigate this problem.\"),mdx(\"p\",null,\"To do this you will have to look at your successes differently: a big part of your successes were privileges gifted to you by other people, society, time, or lottery. This thought that most of your successes are not solely your own should humble you. And the next time someone on a \\u201Clower level\\u201D than you seeks help, instead of looking down on them think if it is because that person just wasn\\u2019t as privileged as you are, maybe they weren\\u2019t given enough runway to properly take off. You should do this even if you think you are the one struggling.\"),mdx(\"p\",null,\"This should naturally drive you to help people more, especially in little daily life challenges. Which means you contribute a tiny runway for them. In the bigger picture, the more we do this the greater head start our next generation gets.\"),mdx(\"p\",null,mdx(\"em\",{parentName:\"p\"},\"Originally published at\"),\" \",mdx(\"a\",r({parentName:\"p\"},{href:\"http://blog.asadmemon.com/post/129677709624/privileges\"}),mdx(\"em\",{parentName:\"a\"},\"blog.asadmemon.com\")),mdx(\"em\",{parentName:\"p\"},\".\")))}MDXContent.isMDXComponent=!0;\n","scope":{}}},"__N_SSG":true}